Revit 2026 API

# SaveAsOptions Class

---

This class contains options available for saving a document to disk with a new filename.

SystemObject Autodesk.Revit.DBSaveAsOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SaveAsOptions : IDisposable
```
```vb
Public Class SaveAsOptions
	Implements IDisposable
```
```cpp
public ref class SaveAsOptions : IDisposable
```
```fsharp
type SaveAsOptions =
    class
        interface IDisposable
    end
```

The SaveAsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SaveAsOptions | Default constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | Compact | Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaximumBackups | The maximum number of backups to keep on disk. |
|  | OverwriteExistingFile | Identifies if the operation should be able to overwrite an existing file. |
|  | PreviewViewId | The view id that will be used to generate the preview; this id is not saved to the document's permanent settings. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SaveAsOptions |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWorksharingOptions | Gets Worksharing options for SaveAs. |
|  | SetWorksharingOptions | Sets Worksharing options for SaveAs. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace